# StructuralAnalyticalTessellate Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralAnalyticalTessellate Property
ParameterTypeId Class See Also
---
"Approximate curve"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralAnalyticalTessellate { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralAnalyticalTessellate As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralAnalyticalTessellate {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace